{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting the removal of all continuous looping animations (marquee, float, pulse keyframes) from Hero, Partners, and index.css, keeping only hover and scroll-triggered animations.",
  "frontend-file-summaries.txt": "JSON map of frontend source files to short descriptions summarizing each component's purpose and any animation-related changes applied.",
  "frontend/index.css": "Minimal global stylesheet applying Tailwind layers and defining OKLCH-based CSS design tokens for light and dark themes with no custom keyframe animations.",
  "frontend/index.html": "HTML entry point that loads Poppins from Google Fonts, sets SEO meta tags for MriCare+, and mounts the Vite/React app via the root div.",
  "frontend/src/App.tsx": "Root React component that assembles the full single-page dental clinic site by rendering all section components in order from AnnouncementBar to Footer.",
  "frontend/src/components/AnnouncementBar.tsx": "Fixed top bar with a purple background advertising a free dental consultation and a 'Book Now' anchor link to the consultation section.",
  "frontend/src/components/ConsultationForm.tsx": "Split-layout consultation booking section with a validated form for name, email, phone, service, and message, plus a success state after submission.",
  "frontend/src/components/Dentistry.tsx": "Section showcasing modern dentistry features via two large image cards (experienced dentists, modern technology) and three smaller icon cards with hover lift effects.",
  "frontend/src/components/Doctors.tsx": "Grid of four doctor cards displaying photo, name, specialization, star rating, and a social media icon overlay that appears on hover.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, social links, quick nav links, services list, and contact details in a 4-column grid layout.",
  "frontend/src/components/Hero.tsx": "Hero section with animated fade-in, count-up stats (doctors, facilities), CTA buttons, and a two-column layout for the dental clinic landing page.",
  "frontend/src/components/Navbar.tsx": "Fixed top navigation bar with scroll-shadow effect, desktop nav links, a search button, and a collapsible mobile hamburger menu.",
  "frontend/src/components/Partners.tsx": "Displays a row of healthcare partner brand names as styled pill badges with grayscale-to-color hover effect.",
  "frontend/src/components/Procedures.tsx": "Showcases three dental procedure cards (Gum Surgery, Consultation, Tooth Extraction) with images, pricing, and action buttons in a 3-column grid.",
  "frontend/src/components/Services.tsx": "Renders a 6-card grid of dental services (checkups, consultations, emergency care, etc.) each with a Lucide icon, title, and description.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state, AuthClient creation, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines a `useSubmitConsultation` mutation hook using React Query that simulates a successful consultation form submission against a backend actor.",
  "frontend/src/index.css": "Global stylesheet importing Poppins font, Tailwind directives, and defining CSS custom properties for the clinic's purple design system including light/dark mode tokens.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with Poppins font, oklch-based color tokens for the clinic design system, custom border radii, accordion animations, and typography/container-queries/animate plugins.",
  "project_state.json": "Tracks the project's current state (version 7) for a premium dental clinic website (MriCare+), recording architectural notes, existing features, and known issues."
}