{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point for the Internet Computer canister.",
  "feature_evidence.json": "Feature evidence report mapping the audit/fix compilation errors feature to its associated frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-line descriptions of each frontend source file for build planning reference.",
  "frontend/index.css": "Global CSS file that sets up Tailwind layers and defines OKLCH-based design tokens for light and dark themes.",
  "frontend/index.html": "HTML entry point that loads Poppins from Google Fonts, sets SEO meta tags, and bootstraps the Vite/React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component that assembles all page sections (AnnouncementBar through Footer) into a single-page dental clinic layout.",
  "frontend/src/components/AnnouncementBar.tsx": "Fixed top bar with a purple background advertising a free dental consultation and a 'Book Now' anchor link.",
  "frontend/src/components/ConsultationForm.tsx": "Consultation booking section with a validated form (name, email, phone, service, message), loading/success states, and a React Query mutation for submission.",
  "frontend/src/components/Dentistry.tsx": "Section showcasing modern dentistry features via two large image cards and three smaller icon cards using Lucide icons.",
  "frontend/src/components/Doctors.tsx": "Grid of four doctor cards displaying photo, name, specialization, star rating, and a social media icon overlay on hover.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, social links, quick nav links, services list, and contact details in a 4-column grid layout.",
  "frontend/src/components/Hero.tsx": "Hero section with animated fade-in, count-up stats (doctors, facilities), CTA buttons, and a right-column visual; uses an IntersectionObserver-style visibility trigger.",
  "frontend/src/components/Navbar.tsx": "Fixed top navbar with scroll-shadow effect, desktop nav links, a search icon, a 'Get Started' CTA, and a collapsible mobile hamburger menu.",
  "frontend/src/components/Partners.tsx": "Displays a horizontally auto-scrolling marquee of healthcare partner brand names against a light background.",
  "frontend/src/components/Procedures.tsx": "Showcases three dental procedure cards (Gum Surgery, Consultation, Tooth Extraction) with images, pricing, and action buttons in a 3-column grid.",
  "frontend/src/components/Services.tsx": "Renders a 6-card grid of dental/healthcare services (checkups, consultations, emergency care, etc.) with Lucide icons and hover animations.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor (authenticated or anonymous) via React Query, and invalidates dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state, AuthClient creation, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines a `useSubmitConsultation` mutation hook using React Query that simulates a successful consultation form submission against a backend actor.",
  "frontend/src/index.css": "Global stylesheet importing Poppins font, Tailwind directives, and defining CSS custom properties for the clinic's purple design system including light/dark mode tokens and utility animations.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with Poppins font, oklch-based design tokens, clinic-specific color palette, border radius, accordion animations, and typography/container-queries/animate plugins.",
  "project_state.json": "Tracks the project state (version 5) for a premium dental clinic website (MriCare+), documenting architectural notes, existing features, and known issues."
}