{
  "kind": "build_request",
  "title": "Remove unnecessary continuous/looping animations site-wide",
  "projectName": "MriCare+",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-14",
      "text": "Remove all unnecessary continuous/looping animations throughout the site. Specifically: stop the auto-scrolling marquee in the Partners section (remove or pause the infinite horizontal scroll), remove any floating element slow rotation or perpetual CSS keyframe animations in the Hero section, and eliminate any other elements that animate on a continuous loop without user interaction. Keep only meaningful animations: hover effects (card lift, image zoom, button scale), scroll-triggered fade-in on section entry, and one-time load animations such as the stats counter. After changes, no element should be in constant motion on the page during normal browsing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "remove the inrelevent animation at is every place the things is conitinous moving"
        ]
      },
      "acceptanceCriteria": [
        "The Partners section marquee no longer auto-scrolls continuously; partner logos are displayed statically or only animate on user interaction.",
        "The floating circular element in the Hero section no longer rotates or pulses in a continuous loop.",
        "No other section contains elements with infinite CSS animation loops or perpetual motion during idle browsing.",
        "Hover animations (card lift, image zoom, button scale) still function correctly across all sections.",
        "Scroll-triggered fade-in animations still trigger once when sections enter the viewport.",
        "The stats counter animation in the Hero still plays once on load/scroll entry and does not loop."
      ]
    }
  ],
  "constraints": [
    "Do not remove hover-triggered animations (card lift, image zoom, button scale).",
    "Do not remove one-time scroll-triggered fade-in animations.",
    "Do not remove the one-time stats counter animation in the Hero section."
  ],
  "nonGoals": [
    "Redesigning any section layout or visual style.",
    "Adding new animations.",
    "Modifying backend logic."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}