{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove unnecessary continuous/looping animations site-wide",
  "requirements": [
    {
      "id": "REQ-14",
      "summary": "Remove all continuous/looping animations from the site, keeping only hover effects, scroll-triggered fade-ins, and one-time load animations like the stats counter",
      "acceptanceCriteria": [
        "The Partners section marquee no longer auto-scrolls continuously; partner logos are displayed statically or only animate on user interaction.",
        "The floating circular element in the Hero section no longer rotates or pulses in a continuous loop.",
        "No other section contains elements with infinite CSS animation loops or perpetual motion during idle browsing.",
        "Hover animations (card lift, image zoom, button scale) still function correctly across all sections.",
        "Scroll-triggered fade-in animations still trigger once when sections enter the viewport.",
        "The stats counter animation in the Hero still plays once on load/scroll entry and does not loop."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Partners.tsx",
          "operation": "modify",
          "description": "Remove the infinite horizontal auto-scrolling marquee animation from the partner brand names section. Display partner logos statically in a flex or grid layout without continuous motion. Ensure partner names remain visible and accessible without requiring animation."
        },
        {
          "path": "frontend/src/components/Hero.tsx",
          "operation": "modify",
          "description": "Remove any floating circular element with continuous rotation or pulse animations. Inspect for CSS keyframe animations or transform effects that create perpetual motion (e.g., rotate, pulse, float). Preserve the one-time animated fade-in, the count-up stats animation that plays once on visibility, and any hover effects. Ensure no element continuously animates during idle browsing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Remove or disable any global CSS keyframe animations that create infinite loops (e.g., @keyframes with animation-iteration-count: infinite for rotation, pulse, float, or similar effects). Preserve utility animations for fade-in, slide, and accordion that trigger once or on user interaction. Ensure no background elements or decorative shapes animate continuously."
        },
        {
          "path": "frontend/src/components/Services.tsx",
          "operation": "modify",
          "description": "Verify that service cards use only hover animations (lift, scale, shadow changes) and remove any continuous motion or looping animations if present. Ensure cards remain static during idle browsing."
        },
        {
          "path": "frontend/src/components/Procedures.tsx",
          "operation": "modify",
          "description": "Verify that procedure cards use only hover animations (lift, scale, image zoom) and remove any continuous motion or looping animations if present. Ensure cards remain static during idle browsing."
        },
        {
          "path": "frontend/src/components/Doctors.tsx",
          "operation": "modify",
          "description": "Verify that doctor cards use only hover animations (overlay, icon appearance) and remove any continuous motion or looping animations if present. Ensure cards remain static during idle browsing."
        },
        {
          "path": "frontend/src/components/Dentistry.tsx",
          "operation": "modify",
          "description": "Verify that image cards and icon cards use only hover animations (zoom, lift) and remove any continuous motion or looping animations if present. Ensure cards remain static during idle browsing."
        }
      ]
    }
  ]
}